
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.alert_action_group_name
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
* Replace
  * azurerm_consumption_budget_resource_group.grafana-budget-alert[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_consumption_budget_resource_group.grafana-budget-alert[0] must be replaced
-/+ resource "azurerm_consumption_budget_resource_group" "grafana-budget-alert" {
      ~ etag              = "\"1dacc65f0b9eeec\"" -> (known after apply)
      ~ id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Consumption/budgets/grafana-budget-alert" -> (known after apply)
        name              = "grafana-budget-alert"
        # (3 unchanged attributes hidden)

      - notification { # forces replacement
          - contact_emails = [] -> null
          - contact_groups = [
              - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/microsoft.insights/actionGroups/DTSSE Alert (aat)",
            ] -> null
          - contact_roles  = [] -> null
          - enabled        = true -> null
          - operator       = "GreaterThanOrEqualTo" -> null
          - threshold      = 90 -> null
          - threshold_type = "Forecasted" -> null
        }
      + notification { # forces replacement
          + contact_emails = []
          + contact_groups = (known after apply)
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 90
          + threshold_type = "Forecasted"
        }

      ~ time_period {
          ~ end_date   = "2034-07-01T00:00:00Z" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.alert_action_group_name will be updated in-place
  ~ resource "azurerm_key_vault_secret" "alert_action_group_name" {
        id                      = "https://dtsse-aat.vault.azure.net/secrets/alert-action-group-name/ae80b89905c045bfadbe44b57f8ad969"
        name                    = "alert-action-group-name"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group has changed
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
      ~ output_content           = jsonencode(
          ~ {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/microsoft.insights/actionGroups/DTSSE Alert (aat)"
                }
            }
        )
        tags                     = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":168,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->